[
    {
        "title": "Adaptively Pruned Spiking Neural Networks for Energy-Efficient\n  Intracortical Neural Decoding",
        "summary": "Intracortical brain-machine interfaces demand low-latency, energy-efficient\nsolutions for neural decoding. Spiking Neural Networks (SNNs) deployed on\nneuromorphic hardware have demonstrated remarkable efficiency in neural\ndecoding by leveraging sparse binary activations and efficient spatiotemporal\nprocessing. However, reducing the computational cost of SNNs remains a critical\nchallenge for developing ultra-efficient intracortical neural implants. In this\nwork, we introduce a novel adaptive pruning algorithm specifically designed for\nSNNs with high activation sparsity, targeting intracortical neural decoding.\nOur method dynamically adjusts pruning decisions and employs a rollback\nmechanism to selectively eliminate redundant synaptic connections without\ncompromising decoding accuracy. Experimental evaluation on the NeuroBench\nNon-Human Primate (NHP) Motor Prediction benchmark shows that our pruned\nnetwork achieves performance comparable to dense networks, with a maximum\ntenfold improvement in efficiency. Moreover, hardware simulation on the\nneuromorphic processor reveals that the pruned network operates at sub-$\\mu$W\npower levels, underscoring its potential for energy-constrained neural\nimplants. These results underscore the promise of our approach for advancing\nenergy-efficient intracortical brain-machine interfaces with low-overhead\non-device intelligence.",
        "link": "http://arxiv.org/abs/2504.11568v1",
        "source": "arXiv",
        "date": "2025-04-15 19:16:34"
    },
    {
        "title": "SpikeStream: Accelerating Spiking Neural Network Inference on RISC-V\n  Clusters with Sparse Computation Extensions",
        "summary": "Spiking Neural Network (SNN) inference has a clear potential for high energy\nefficiency as computation is triggered by events. However, the inherent\nsparsity of events poses challenges for conventional computing systems, driving\nthe development of specialized neuromorphic processors, which come with high\nsilicon area costs and lack the flexibility needed for running other\ncomputational kernels, limiting widespread adoption. In this paper, we explore\nthe low-level software design, parallelization, and acceleration of SNNs on\ngeneral-purpose multicore clusters with a low-overhead RISC-V ISA extension for\nstreaming sparse computations. We propose SpikeStream, an optimization\ntechnique that maps weights accesses to affine and indirect register-mapped\nmemory streams to enhance performance, utilization, and efficiency. Our results\non the end-to-end Spiking-VGG11 model demonstrate a significant 4.39x speedup\nand an increase in utilization from 9.28% to 52.3% compared to a non-streaming\nparallel baseline. Additionally, we achieve an energy efficiency gain of 3.46x\nover LSMCore and a performance gain of 2.38x over Loihi.",
        "link": "http://arxiv.org/abs/2504.06134v1",
        "source": "arXiv",
        "date": "2025-04-08 15:28:44"
    },
    {
        "title": "Enabling Efficient Processing of Spiking Neural Networks with On-Chip\n  Learning on Commodity Neuromorphic Processors for Edge AI Systems",
        "summary": "The rising demand for energy-efficient edge AI systems (e.g., mobile\nagents/robots) has increased the interest in neuromorphic computing, since it\noffers ultra-low power/energy AI computation through spiking neural network\n(SNN) algorithms on neuromorphic processors. However, their efficient\nimplementation strategy has not been comprehensively studied, hence limiting\nSNN deployments for edge AI systems. Toward this, we propose a design\nmethodology to enable efficient SNN processing on commodity neuromorphic\nprocessors. To do this, we first study the key characteristics of targeted\nneuromorphic hardware (e.g., memory and compute budgets), and leverage this\ninformation to perform compatibility analysis for network selection. Afterward,\nwe employ a mapping strategy for efficient SNN implementation on the targeted\nprocessor. Furthermore, we incorporate an efficient on-chip learning mechanism\nto update the systems' knowledge for adapting to new input classes and dynamic\nenvironments. The experimental results show that the proposed methodology leads\nthe system to achieve low latency of inference (i.e., less than 50ms for image\nclassification, less than 200ms for real-time object detection in video\nstreaming, and less than 1ms in keyword recognition) and low latency of on-chip\nlearning (i.e., less than 2ms for keyword recognition), while incurring less\nthan 250mW of processing power and less than 15mJ of energy consumption across\nthe respective different applications and scenarios. These results show the\npotential of the proposed methodology in enabling efficient edge AI systems for\ndiverse application use-cases.",
        "link": "http://arxiv.org/abs/2504.00957v1",
        "source": "arXiv",
        "date": "2025-04-01 16:52:03"
    },
    {
        "title": "Real-time Sub-milliwatt Epilepsy Detection Implemented on a Spiking\n  Neural Network Edge Inference Processor",
        "summary": "Analyzing electroencephalogram (EEG) signals to detect the epileptic seizure\nstatus of a subject presents a challenge to existing technologies aimed at\nproviding timely and efficient diagnosis. In this study, we aimed to detect\ninterictal and ictal periods of epileptic seizures using a spiking neural\nnetwork (SNN). Our proposed approach provides an online and real-time\npreliminary diagnosis of epileptic seizures and helps to detect possible\npathological conditions.To validate our approach, we conducted experiments\nusing multiple datasets. We utilized a trained SNN to identify the presence of\nepileptic seizures and compared our results with those of related studies. The\nSNN model was deployed on Xylo, a digital SNN neuromorphic processor designed\nto process temporal signals. Xylo efficiently simulates spiking leaky\nintegrate-and-fire neurons with exponential input synapses. Xylo has much lower\nenergy requirments than traditional approaches to signal processing, making it\nan ideal platform for developing low-power seizure detection systems.Our\nproposed method has a high test accuracy of 93.3% and 92.9% when classifying\nictal and interictal periods. At the same time, the application has an average\npower consumption of 87.4 uW(IO power) + 287.9 uW(computational power) when\ndeployed to Xylo. Our method demonstrates excellent low-latency performance\nwhen tested on multiple datasets. Our work provides a new solution for seizure\ndetection, and it is expected to be widely used in portable and wearable\ndevices in the future.",
        "link": "http://arxiv.org/abs/2410.16613v1",
        "source": "arXiv",
        "date": "2024-10-22 01:55:02"
    },
    {
        "title": "Analog Spiking Neuron in CMOS 28 nm Towards Large-Scale Neuromorphic\n  Processors",
        "summary": "The computational complexity of deep learning algorithms has given rise to\nsignificant speed and memory challenges for the execution hardware. In\nenergy-limited portable devices, highly efficient processing platforms are\nindispensable for reproducing the prowess afforded by much bulkier processing\nplatforms.\n  In this work, we present a low-power Leaky Integrate-and-Fire (LIF) neuron\ndesign fabricated in TSMC's 28 nm CMOS technology as proof of concept to build\nan energy-efficient mixed-signal Neuromorphic System-on-Chip (NeuroSoC). The\nfabricated neuron consumes 1.61 fJ/spike and occupies an active area of 34 $\\mu\nm^{2}$, leading to a maximum spiking frequency of 300 kHz at 250 mV power\nsupply.\n  These performances are used in a software model to emulate the dynamics of a\nSpiking Neural Network (SNN). Employing supervised backpropagation and a\nsurrogate gradient technique, the resulting accuracy on the MNIST dataset,\nusing 4-bit post-training quantization stands at 82.5\\%. The approach\nunderscores the potential of such ASIC implementation of quantized SNNs to\ndeliver high-performance, energy-efficient solutions to various embedded\nmachine-learning applications.",
        "link": "http://arxiv.org/abs/2408.07734v1",
        "source": "arXiv",
        "date": "2024-08-14 17:51:20"
    },
    {
        "title": "Event-based Optical Flow on Neuromorphic Processor: ANN vs. SNN\n  Comparison based on Activation Sparsification",
        "summary": "Spiking neural networks (SNNs) for event-based optical flow are claimed to be\ncomputationally more efficient than their artificial neural networks (ANNs)\ncounterparts, but a fair comparison is missing in the literature. In this work,\nwe propose an event-based optical flow solution based on activation\nsparsification and a neuromorphic processor, SENECA. SENECA has an event-driven\nprocessing mechanism that can exploit the sparsity in ANN activations and SNN\nspikes to accelerate the inference of both types of neural networks. The ANN\nand the SNN for comparison have similar low activation/spike density (~5%)\nthanks to our novel sparsification-aware training. In the hardware-in-loop\nexperiments designed to deduce the average time and energy consumption, the SNN\nconsumes 44.9ms and 927.0 microjoules, which are 62.5% and 75.2% of the ANN's\nconsumption, respectively. We find that SNN's higher efficiency attributes to\nits lower pixel-wise spike density (43.5% vs. 66.5%) that requires fewer memory\naccess operations for neuron states.",
        "link": "http://arxiv.org/abs/2407.20421v1",
        "source": "arXiv",
        "date": "2024-07-29 21:22:53"
    },
    {
        "title": "To Spike or Not to Spike, that is the Question",
        "summary": "Neuromorphic computing has recently gained momentum with the emergence of\nvarious neuromorphic processors. As the field advances, there is an increasing\nfocus on developing training methods that can effectively leverage the unique\nproperties of spiking neural networks (SNNs). SNNs emulate the temporal\ndynamics of biological neurons, making them particularly well-suited for\nreal-time, event-driven processing. To fully harness the potential of SNNs\nacross different neuromorphic platforms, effective training methodologies are\nessential. In SNNs, learning rules are based on neurons' spiking behavior, that\nis, if and when spikes are generated due to a neuron's membrane potential\nexceeding that neuron's spiking threshold, and this spike timing encodes vital\ninformation. However, the threshold is generally treated as a hyperparameter,\nand incorrect selection can lead to neurons that do not spike for large\nportions of the training process, hindering the effective rate of learning.\nThis work focuses on the significance of learning neuron thresholds alongside\nweights in SNNs. Our results suggest that promoting threshold from a\nhyperparameter to a trainable parameter effectively addresses the issue of dead\nneurons during training. This leads to a more robust training algorithm,\nresulting in improved convergence, increased test accuracy, and a substantial\nreduction in the number of training epochs required to achieve viable accuracy\non spatiotemporal datasets such as NMNIST, DVS128, and Spiking Heidelberg\nDigits (SHD), with up to 30% training speed-up and up to 2% higher accuracy on\nthese datasets.",
        "link": "http://arxiv.org/abs/2407.19566v3",
        "source": "arXiv",
        "date": "2024-07-28 19:23:09"
    },
    {
        "title": "Evaluation of Encoding Schemes on Ubiquitous Sensor Signal for Spiking\n  Neural Network",
        "summary": "Spiking neural networks (SNNs), a brain-inspired computing paradigm, are\nemerging for their inference performance, particularly in terms of energy\nefficiency and latency attributed to the plasticity in signal processing. To\ndeploy SNNs in ubiquitous computing systems, signal encoding of sensors is\ncrucial for achieving high accuracy and robustness. Using inertial sensor\nreadings for gym activity recognition as a case study, this work\ncomprehensively evaluates four main encoding schemes and deploys the\ncorresponding SNN on the neuromorphic processor Loihi2 for post-deployment\nencoding assessment. Rate encoding, time-to-first-spike encoding, binary\nencoding, and delta modulation are evaluated using metrics like average fire\nrate, signal-to-noise ratio, classification accuracy, robustness, and inference\nlatency and energy. In this case study, the time-to-first-spike encoding\nrequired the lowest firing rate (2%) and achieved a comparative accuracy (89%),\nalthough it was the least robust scheme against error spikes (over 20% accuracy\ndrop with 0.1 noisy spike rate). Rate encoding with optimal\nvalue-to-probability mapping achieved the highest accuracy (91.7%). Binary\nencoding provided a balance between information reconstruction and noise\nresistance. Multi-threshold delta modulation showed the best robustness, with\nonly a 0.7% accuracy drop at a 0.1 noisy spike rate. This work serves\nresearchers in selecting the best encoding scheme for SNN-based ubiquitous\nsensor signal processing, tailored to specific performance requirements.",
        "link": "http://arxiv.org/abs/2407.09260v1",
        "source": "arXiv",
        "date": "2024-07-12 13:42:41"
    },
    {
        "title": "Towards Efficient Deployment of Hybrid SNNs on Neuromorphic and Edge AI\n  Hardware",
        "summary": "This paper explores the synergistic potential of neuromorphic and edge\ncomputing to create a versatile machine learning (ML) system tailored for\nprocessing data captured by dynamic vision sensors. We construct and train\nhybrid models, blending spiking neural networks (SNNs) and artificial neural\nnetworks (ANNs) using PyTorch and Lava frameworks. Our hybrid architecture\nintegrates an SNN for temporal feature extraction and an ANN for\nclassification. We delve into the challenges of deploying such hybrid\nstructures on hardware. Specifically, we deploy individual components on\nIntel's Neuromorphic Processor Loihi (for SNN) and Jetson Nano (for ANN). We\nalso propose an accumulator circuit to transfer data from the spiking to the\nnon-spiking domain. Furthermore, we conduct comprehensive performance analyses\nof hybrid SNN-ANN models on a heterogeneous system of neuromorphic and edge AI\nhardware, evaluating accuracy, latency, power, and energy consumption. Our\nfindings demonstrate that the hybrid spiking networks surpass the baseline ANN\nmodel across all metrics and outperform the baseline SNN model in accuracy and\nlatency.",
        "link": "http://arxiv.org/abs/2407.08704v1",
        "source": "arXiv",
        "date": "2024-07-11 17:40:39"
    },
    {
        "title": "Micro-power spoken keyword spotting on Xylo Audio 2",
        "summary": "For many years, designs for \"Neuromorphic\" or brain-like processors have been\nmotivated by achieving extreme energy efficiency, compared with von-Neumann and\ntensor processor devices. As part of their design language, Neuromorphic\nprocessors take advantage of weight, parameter, state and activity sparsity. In\nthe extreme case, neural networks based on these principles mimic the sparse\nactivity oof biological nervous systems, in ``Spiking Neural Networks'' (SNNs).\nFew benchmarks are available for Neuromorphic processors, that have been\nimplemented for a range of Neuromorphic and non-Neuromorphic platforms, which\ncan therefore demonstrate the energy benefits of Neuromorphic processor\ndesigns. Here we describes the implementation of a spoken audio\nkeyword-spotting (KWS) benchmark \"Aloha\" on the Xylo Audio 2 (SYNS61210)\nNeuromorphic processor device. We obtained high deployed quantized task\naccuracy, (95%), exceeding the benchmark task accuracy. We measured real\ncontinuous power of the deployed application on Xylo. We obtained best-in-class\ndynamic inference power ($291\\mu$W) and best-in-class inference efficiency\n($6.6\\mu$J / Inf). Xylo sets a new minimum power for the Aloha KWS benchmark,\nand highlights the extreme energy efficiency achievable with Neuromorphic\nprocessor designs. Our results show that Neuromorphic designs are well-suited\nfor real-time near- and in-sensor processing on edge devices.",
        "link": "http://arxiv.org/abs/2406.15112v1",
        "source": "arXiv",
        "date": "2024-06-21 12:59:37"
    },
    {
        "title": "Neuromorphic dreaming: A pathway to efficient learning in artificial\n  agents",
        "summary": "Achieving energy efficiency in learning is a key challenge for artificial\nintelligence (AI) computing platforms. Biological systems demonstrate\nremarkable abilities to learn complex skills quickly and efficiently. Inspired\nby this, we present a hardware implementation of model-based reinforcement\nlearning (MBRL) using spiking neural networks (SNNs) on mixed-signal\nanalog/digital neuromorphic hardware. This approach leverages the energy\nefficiency of mixed-signal neuromorphic chips while achieving high sample\nefficiency through an alternation of online learning, referred to as the\n\"awake\" phase, and offline learning, known as the \"dreaming\" phase. The model\nproposed includes two symbiotic networks: an agent network that learns by\ncombining real and simulated experiences, and a learned world model network\nthat generates the simulated experiences. We validate the model by training the\nhardware implementation to play the Atari game Pong. We start from a baseline\nconsisting of an agent network learning without a world model and dreaming,\nwhich successfully learns to play the game. By incorporating dreaming, the\nnumber of required real game experiences are reduced significantly compared to\nthe baseline. The networks are implemented using a mixed-signal neuromorphic\nprocessor, with the readout layers trained using a computer in-the-loop, while\nthe other layers remain fixed. These results pave the way toward\nenergy-efficient neuromorphic learning systems capable of rapid learning in\nreal world applications and use-cases.",
        "link": "http://arxiv.org/abs/2405.15616v1",
        "source": "arXiv",
        "date": "2024-05-24 15:03:56"
    },
    {
        "title": "EchoSpike Predictive Plasticity: An Online Local Learning Rule for\n  Spiking Neural Networks",
        "summary": "The drive to develop artificial neural networks that efficiently utilize\nresources has generated significant interest in bio-inspired Spiking Neural\nNetworks (SNNs). These networks are particularly attractive due to their\npotential in applications requiring low power and memory. This potential is\nfurther enhanced by the ability to perform online local learning, enabling them\nto adapt to dynamic environments. This requires the model to be adaptive in a\nself-supervised manner. While self-supervised learning has seen great success\nin many deep learning domains, its application for online local learning in\nmulti-layer SNNs remains underexplored. In this paper, we introduce the\n\"EchoSpike Predictive Plasticity\" (ESPP) learning rule, a pioneering online\nlocal learning rule designed to leverage hierarchical temporal dynamics in SNNs\nthrough predictive and contrastive coding. We validate the effectiveness of\nthis approach using benchmark datasets, demonstrating that it performs on par\nwith current state-of-the-art supervised learning rules. The temporal and\nspatial locality of ESPP makes it particularly well-suited for low-cost\nneuromorphic processors, representing a significant advancement in developing\nbiologically plausible self-supervised learning models for neuromorphic\ncomputing at the edge.",
        "link": "http://arxiv.org/abs/2405.13976v2",
        "source": "arXiv",
        "date": "2024-05-22 20:20:43"
    },
    {
        "title": "A Neuromorphic Approach to Obstacle Avoidance in Robot Manipulation",
        "summary": "Neuromorphic computing mimics computational principles of the brain in\n$\\textit{silico}$ and motivates research into event-based vision and spiking\nneural networks (SNNs). Event cameras (ECs) exclusively capture local intensity\nchanges and offer superior power consumption, response latencies, and dynamic\nranges. SNNs replicate biological neuronal dynamics and have demonstrated\npotential as alternatives to conventional artificial neural networks (ANNs),\nsuch as in reducing energy expenditure and inference time in visual\nclassification. Nevertheless, these novel paradigms remain scarcely explored\noutside the domain of aerial robots.\n  To investigate the utility of brain-inspired sensing and data processing, we\ndeveloped a neuromorphic approach to obstacle avoidance on a camera-equipped\nmanipulator. Our approach adapts high-level trajectory plans with reactive\nmaneuvers by processing emulated event data in a convolutional SNN, decoding\nneural activations into avoidance motions, and adjusting plans using a dynamic\nmotion primitive. We conducted experiments with a Kinova Gen3 arm performing\nsimple reaching tasks that involve obstacles in sets of distinct task scenarios\nand in comparison to a non-adaptive baseline.\n  Our neuromorphic approach facilitated reliable avoidance of imminent\ncollisions in simulated and real-world experiments, where the baseline\nconsistently failed. Trajectory adaptations had low impacts on safety and\npredictability criteria. Among the notable SNN properties were the correlation\nof computations with the magnitude of perceived motions and a robustness to\ndifferent event emulation methods. Tests with a DAVIS346 EC showed similar\nperformance, validating our experimental event emulation. Our results motivate\nincorporating SNN learning, utilizing neuromorphic processors, and further\nexploring the potential of neuromorphic methods.",
        "link": "http://arxiv.org/abs/2404.05858v1",
        "source": "arXiv",
        "date": "2024-04-08 20:42:10"
    },
    {
        "title": "Performance Evaluation of Neuromorphic Hardware for Onboard Satellite\n  Communication Applications",
        "summary": "Spiking neural networks (SNNs) implemented on neuromorphic processors (NPs)\ncan enhance the energy efficiency of deployments of artificial intelligence\n(AI) for specific workloads. As such, NP represents an interesting opportunity\nfor implementing AI tasks on board power-limited satellite communication\nspacecraft. In this article, we disseminate the findings of a recently\ncompleted study which targeted the comparison in terms of performance and\npower-consumption of different satellite communication use cases implemented on\nstandard AI accelerators and on NPs. In particular, the article describes three\nprominent use cases, namely payload resource optimization, onboard interference\ndetection and classification, and dynamic receive beamforming; and compare the\nperformance of conventional convolutional neural networks (CNNs) implemented on\nXilinx's VCK5000 Versal development card and SNNs on Intel's neuromorphic chip\nLoihi 2.",
        "link": "http://arxiv.org/abs/2401.06911v1",
        "source": "arXiv",
        "date": "2024-01-12 21:56:57"
    },
    {
        "title": "Expanding memory in recurrent spiking networks",
        "summary": "Recurrent spiking neural networks (RSNNs) are notoriously difficult to train\nbecause of the vanishing gradient problem that is enhanced by the binary nature\nof the spikes. In this paper, we review the ability of the current\nstate-of-the-art RSNNs to solve long-term memory tasks, and show that they have\nstrong constraints both in performance, and for their implementation on\nhardware analog neuromorphic processors. We present a novel spiking neural\nnetwork that circumvents these limitations. Our biologically inspired neural\nnetwork uses synaptic delays, branching factor regularization and a novel\nsurrogate derivative for the spiking function. The proposed network proves to\nbe more successful in using the recurrent connections on memory tasks.",
        "link": "http://arxiv.org/abs/2310.19067v1",
        "source": "arXiv",
        "date": "2023-10-29 16:46:26"
    },
    {
        "title": "Feed-forward and recurrent inhibition for compressing and classifying\n  high dynamic range biosignals in spiking neural network architectures",
        "summary": "Neuromorphic processors that implement Spiking Neural Networks (SNNs) using\nmixed-signal analog/digital circuits represent a promising technology for\nclosed-loop real-time processing of biosignals. As in biology, to minimize\npower consumption, the silicon neurons' circuits are configured to fire with a\nlimited dynamic range and with maximum firing rates restricted to a few tens or\nhundreds of Herz.\n  However, biosignals can have a very large dynamic range, so encoding them\ninto spikes without saturating the neuron outputs represents an open challenge.\n  In this work, we present a biologically-inspired strategy for compressing\nthis high-dynamic range in SNN architectures, using three adaptation mechanisms\nubiquitous in the brain: spike-frequency adaptation at the single neuron level,\nfeed-forward inhibitory connections from neurons belonging to the input layer,\nand Excitatory-Inhibitory (E-I) balance via recurrent inhibition among neurons\nin the output layer.\n  We apply this strategy to input biosignals encoded using both an asynchronous\ndelta modulation method and an energy-based pulse-frequency modulation method.\n  We validate this approach in silico, simulating a simple network applied to a\ngesture classification task from surface EMG recordings.",
        "link": "http://arxiv.org/abs/2309.16425v1",
        "source": "arXiv",
        "date": "2023-09-28 13:22:51"
    },
    {
        "title": "SPAIC: A sub-$μ$W/Channel, 16-Channel General-Purpose Event-Based\n  Analog Front-End with Dual-Mode Encoders",
        "summary": "Low-power event-based analog front-ends (AFE) are a crucial component\nrequired to build efficient end-to-end neuromorphic processing systems for edge\ncomputing. Although several neuromorphic chips have been developed for\nimplementing spiking neural networks (SNNs) and solving a wide range of sensory\nprocessing tasks, there are only a few general-purpose analog front-end devices\nthat can be used to convert analog sensory signals into spikes and interfaced\nto neuromorphic processors. In this work, we present a novel, highly\nconfigurable analog front-end chip, denoted as SPAIC (signal-to-spike converter\nfor analog AI computation), that offers a general-purpose dual-mode analog\nsignal-to-spike encoding with delta modulation and pulse frequency modulation,\nwith tunable frequency bands. The ASIC is designed in a 180 nm process. It\nsupports and encodes a wide variety of signals spanning 4 orders of magnitude\nin frequency, and provides an event-based output that is compatible with\nexisting neuromorphic processors. We validated the ASIC for its functions and\npresent initial silicon measurement results characterizing the basic building\nblocks of the chip.",
        "link": "http://arxiv.org/abs/2309.03221v1",
        "source": "arXiv",
        "date": "2023-08-31 19:53:04"
    },
    {
        "title": "Core interface optimization for multi-core neuromorphic processors",
        "summary": "Hardware implementations of Spiking Neural Networks (SNNs) represent a\npromising approach to edge-computing for applications that require low-power\nand low-latency, and which cannot resort to external cloud-based computing\nservices. However, most solutions proposed so far either support only\nrelatively small networks, or take up significant hardware resources, to\nimplement large networks. To realize large-scale and scalable SNNs it is\nnecessary to develop an efficient asynchronous communication and routing fabric\nthat enables the design of multi-core architectures. In particular the core\ninterface that manages inter-core spike communication is a crucial component as\nit represents the bottleneck of Power-Performance-Area (PPA) especially for the\narbitration architecture and the routing memory. In this paper we present an\narbitration mechanism with the corresponding asynchronous encoding pipeline\ncircuits, based on hierarchical arbiter trees. The proposed scheme reduces the\nlatency by more than 70% in sparse-event mode, compared to the state-of-the-art\narbitration architectures, with lower area cost. The routing memory makes use\nof asynchronous Content Addressable Memory (CAM) with Current Sensing\nCompletion Detection (CSCD), which saves approximately 46% energy, and achieves\na 40% increase in throughput against conventional asynchronous CAM using\nconfigurable delay lines, at the cost of only a slight increase in area. In\naddition as it radically reduces the core interface resources in multi-core\nneuromorphic processors, the arbitration architecture and CAM architecture we\npropose can be also applied to a wide range of general asynchronous circuits\nand systems.",
        "link": "http://arxiv.org/abs/2308.04171v1",
        "source": "arXiv",
        "date": "2023-08-08 10:00:14"
    },
    {
        "title": "Evaluating Spiking Neural Network On Neuromorphic Platform For Human\n  Activity Recognition",
        "summary": "Energy efficiency and low latency are crucial requirements for designing\nwearable AI-empowered human activity recognition systems, due to the hard\nconstraints of battery operations and closed-loop feedback. While neural\nnetwork models have been extensively compressed to match the stringent edge\nrequirements, spiking neural networks and event-based sensing are recently\nemerging as promising solutions to further improve performance due to their\ninherent energy efficiency and capacity to process spatiotemporal data in very\nlow latency. This work aims to evaluate the effectiveness of spiking neural\nnetworks on neuromorphic processors in human activity recognition for wearable\napplications. The case of workout recognition with wrist-worn wearable motion\nsensors is used as a study. A multi-threshold delta modulation approach is\nutilized for encoding the input sensor data into spike trains to move the\npipeline into the event-based approach. The spikes trains are then fed to a\nspiking neural network with direct-event training, and the trained model is\ndeployed on the research neuromorphic platform from Intel, Loihi, to evaluate\nenergy and latency efficiency. Test results show that the spike-based workouts\nrecognition system can achieve a comparable accuracy (87.5\\%) comparable to the\npopular milliwatt RISC-V bases multi-core processor GAP8 with a traditional\nneural network ( 88.1\\%) while achieving two times better energy-delay product\n(0.66 \\si{\\micro\\joule\\second} vs. 1.32 \\si{\\micro\\joule\\second}).",
        "link": "http://arxiv.org/abs/2308.00787v1",
        "source": "arXiv",
        "date": "2023-08-01 18:59:06"
    },
    {
        "title": "Bio-realistic Neural Network Implementation on Loihi 2 with Izhikevich\n  Neurons",
        "summary": "In this paper, we presented a bio-realistic basal ganglia neural network and\nits integration into Intel's Loihi neuromorphic processor to perform simple\nGo/No-Go task. To incorporate more bio-realistic and diverse set of neuron\ndynamics, we used Izhikevich neuron model, implemented as microcode, instead of\nLeaky-Integrate and Fire (LIF) neuron model that has built-in support on Loihi.\nThis work aims to demonstrate the feasibility of implementing computationally\nefficient custom neuron models on Loihi for building spiking neural networks\n(SNNs) that features these custom neurons to realize bio-realistic neural\nnetworks.",
        "link": "http://arxiv.org/abs/2307.11844v2",
        "source": "arXiv",
        "date": "2023-07-21 18:28:17"
    },
    {
        "title": "Neuromorphic computing for attitude estimation onboard quadrotors",
        "summary": "Compelling evidence has been given for the high energy efficiency and update\nrates of neuromorphic processors, with performance beyond what standard Von\nNeumann architectures can achieve. Such promising features could be\nadvantageous in critical embedded systems, especially in robotics. To date, the\nconstraints inherent in robots (e.g., size and weight, battery autonomy,\navailable sensors, computing resources, processing time, etc.), and\nparticularly in aerial vehicles, severely hamper the performance of\nfully-autonomous on-board control, including sensor processing and state\nestimation. In this work, we propose a spiking neural network (SNN) capable of\nestimating the pitch and roll angles of a quadrotor in highly dynamic movements\nfrom 6-degree of freedom Inertial Measurement Unit (IMU) data. With only 150\nneurons and a limited training dataset obtained using a quadrotor in a real\nworld setup, the network shows competitive results as compared to\nstate-of-the-art, non-neuromorphic attitude estimators. The proposed\narchitecture was successfully tested on the Loihi neuromorphic processor\non-board a quadrotor to estimate the attitude when flying. Our results show the\nrobustness of neuromorphic attitude estimation and pave the way towards\nenergy-efficient, fully autonomous control of quadrotors with dedicated\nneuromorphic computing systems.",
        "link": "http://arxiv.org/abs/2304.08802v1",
        "source": "arXiv",
        "date": "2023-04-18 08:07:22"
    },
    {
        "title": "Open the box of digital neuromorphic processor: Towards effective\n  algorithm-hardware co-design",
        "summary": "Sparse and event-driven spiking neural network (SNN) algorithms are the ideal\ncandidate solution for energy-efficient edge computing. Yet, with the growing\ncomplexity of SNN algorithms, it isn't easy to properly benchmark and optimize\ntheir computational cost without hardware in the loop. Although digital\nneuromorphic processors have been widely adopted to benchmark SNN algorithms,\ntheir black-box nature is problematic for algorithm-hardware co-optimization.\nIn this work, we open the black box of the digital neuromorphic processor for\nalgorithm designers by presenting the neuron processing instruction set and\ndetailed energy consumption of the SENeCA neuromorphic architecture. For\nconvenient benchmarking and optimization, we provide the energy cost of the\nessential neuromorphic components in SENeCA, including neuron models and\nlearning rules. Moreover, we exploit the SENeCA's hierarchical memory and\nexhibit an advantage over existing neuromorphic processors. We show the energy\nefficiency of SNN algorithms for video processing and online learning, and\ndemonstrate the potential of our work for optimizing algorithm designs.\nOverall, we present a practical approach to enable algorithm designers to\naccurately benchmark SNN algorithms and pave the way towards effective\nalgorithm-hardware co-design.",
        "link": "http://arxiv.org/abs/2303.15224v1",
        "source": "arXiv",
        "date": "2023-03-27 14:03:11"
    },
    {
        "title": "Fully neuromorphic vision and control for autonomous drone flight",
        "summary": "Biological sensing and processing is asynchronous and sparse, leading to\nlow-latency and energy-efficient perception and action. In robotics,\nneuromorphic hardware for event-based vision and spiking neural networks\npromises to exhibit similar characteristics. However, robotic implementations\nhave been limited to basic tasks with low-dimensional sensory inputs and motor\nactions due to the restricted network size in current embedded neuromorphic\nprocessors and the difficulties of training spiking neural networks. Here, we\npresent the first fully neuromorphic vision-to-control pipeline for controlling\na freely flying drone. Specifically, we train a spiking neural network that\naccepts high-dimensional raw event-based camera data and outputs low-level\ncontrol actions for performing autonomous vision-based flight. The vision part\nof the network, consisting of five layers and 28.8k neurons, maps incoming raw\nevents to ego-motion estimates and is trained with self-supervised learning on\nreal event data. The control part consists of a single decoding layer and is\nlearned with an evolutionary algorithm in a drone simulator. Robotic\nexperiments show a successful sim-to-real transfer of the fully learned\nneuromorphic pipeline. The drone can accurately follow different ego-motion\nsetpoints, allowing for hovering, landing, and maneuvering\nsideways$\\unicode{x2014}$even while yawing at the same time. The neuromorphic\npipeline runs on board on Intel's Loihi neuromorphic processor with an\nexecution frequency of 200 Hz, spending only 27 $\\unicode{x00b5}$J per\ninference. These results illustrate the potential of neuromorphic sensing and\nprocessing for enabling smaller, more intelligent robots.",
        "link": "http://arxiv.org/abs/2303.08778v1",
        "source": "arXiv",
        "date": "2023-03-15 17:19:45"
    },
    {
        "title": "Gradient-descent hardware-aware training and deployment for mixed-signal\n  Neuromorphic processors",
        "summary": "Mixed-signal neuromorphic processors provide extremely low-power operation\nfor edge inference workloads, taking advantage of sparse asynchronous\ncomputation within Spiking Neural Networks (SNNs). However, deploying robust\napplications to these devices is complicated by limited controllability over\nanalog hardware parameters, as well as unintended parameter and dynamical\nvariations of analog circuits due to fabrication non-idealities. Here we\ndemonstrate a novel methodology for ofDine training and deployment of spiking\nneural networks (SNNs) to the mixed-signal neuromorphic processor DYNAP-SE2.\nThe methodology utilizes gradient-based training using a differentiable\nsimulation of the mixed-signal device, coupled with an unsupervised weight\nquantization method to optimize the network's parameters. Parameter noise\ninjection during training provides robustness to the effects of quantization\nand device mismatch, making the method a promising candidate for real-world\napplications under hardware constraints and non-idealities. This work extends\nRockpool, an open-source deep-learning library for SNNs, with support for\naccurate simulation of mixed-signal SNN dynamics. Our approach simplifies the\ndevelopment and deployment process for the neuromorphic community, making\nmixed-signal neuromorphic processors more accessible to researchers and\ndevelopers.",
        "link": "http://arxiv.org/abs/2303.12167v2",
        "source": "arXiv",
        "date": "2023-03-14 08:56:54"
    }
]