[
    {
        "title": "Enabling Efficient Processing of Spiking Neural Networks with On-Chip\n  Learning on Commodity Neuromorphic Processors for Edge AI Systems",
        "summary": "The rising demand for energy-efficient edge AI systems (e.g., mobile\nagents/robots) has increased the interest in neuromorphic computing, since it\noffers ultra-low power/energy AI computation through spiking neural network\n(SNN) algorithms on neuromorphic processors. However, their efficient\nimplementation strategy has not been comprehensively studied, hence limiting\nSNN deployments for edge AI systems. Toward this, we propose a design\nmethodology to enable efficient SNN processing on commodity neuromorphic\nprocessors. To do this, we first study the key characteristics of targeted\nneuromorphic hardware (e.g., memory and compute budgets), and leverage this\ninformation to perform compatibility analysis for network selection. Afterward,\nwe employ a mapping strategy for efficient SNN implementation on the targeted\nprocessor. Furthermore, we incorporate an efficient on-chip learning mechanism\nto update the systems' knowledge for adapting to new input classes and dynamic\nenvironments. The experimental results show that the proposed methodology leads\nthe system to achieve low latency of inference (i.e., less than 50ms for image\nclassification, less than 200ms for real-time object detection in video\nstreaming, and less than 1ms in keyword recognition) and low latency of on-chip\nlearning (i.e., less than 2ms for keyword recognition), while incurring less\nthan 250mW of processing power and less than 15mJ of energy consumption across\nthe respective different applications and scenarios. These results show the\npotential of the proposed methodology in enabling efficient edge AI systems for\ndiverse application use-cases.",
        "link": "http://arxiv.org/abs/2504.00957v2",
        "source": "arXiv",
        "date": "2025-04-01 16:52:03"
    },
    {
        "title": "Towards Efficient Deployment of Hybrid SNNs on Neuromorphic and Edge AI\n  Hardware",
        "summary": "This paper explores the synergistic potential of neuromorphic and edge\ncomputing to create a versatile machine learning (ML) system tailored for\nprocessing data captured by dynamic vision sensors. We construct and train\nhybrid models, blending spiking neural networks (SNNs) and artificial neural\nnetworks (ANNs) using PyTorch and Lava frameworks. Our hybrid architecture\nintegrates an SNN for temporal feature extraction and an ANN for\nclassification. We delve into the challenges of deploying such hybrid\nstructures on hardware. Specifically, we deploy individual components on\nIntel's Neuromorphic Processor Loihi (for SNN) and Jetson Nano (for ANN). We\nalso propose an accumulator circuit to transfer data from the spiking to the\nnon-spiking domain. Furthermore, we conduct comprehensive performance analyses\nof hybrid SNN-ANN models on a heterogeneous system of neuromorphic and edge AI\nhardware, evaluating accuracy, latency, power, and energy consumption. Our\nfindings demonstrate that the hybrid spiking networks surpass the baseline ANN\nmodel across all metrics and outperform the baseline SNN model in accuracy and\nlatency.",
        "link": "http://arxiv.org/abs/2407.08704v1",
        "source": "arXiv",
        "date": "2024-07-11 17:40:39"
    },
    {
        "title": "Micro-power spoken keyword spotting on Xylo Audio 2",
        "summary": "For many years, designs for \"Neuromorphic\" or brain-like processors have been\nmotivated by achieving extreme energy efficiency, compared with von-Neumann and\ntensor processor devices. As part of their design language, Neuromorphic\nprocessors take advantage of weight, parameter, state and activity sparsity. In\nthe extreme case, neural networks based on these principles mimic the sparse\nactivity oof biological nervous systems, in ``Spiking Neural Networks'' (SNNs).\nFew benchmarks are available for Neuromorphic processors, that have been\nimplemented for a range of Neuromorphic and non-Neuromorphic platforms, which\ncan therefore demonstrate the energy benefits of Neuromorphic processor\ndesigns. Here we describes the implementation of a spoken audio\nkeyword-spotting (KWS) benchmark \"Aloha\" on the Xylo Audio 2 (SYNS61210)\nNeuromorphic processor device. We obtained high deployed quantized task\naccuracy, (95%), exceeding the benchmark task accuracy. We measured real\ncontinuous power of the deployed application on Xylo. We obtained best-in-class\ndynamic inference power ($291\\mu$W) and best-in-class inference efficiency\n($6.6\\mu$J / Inf). Xylo sets a new minimum power for the Aloha KWS benchmark,\nand highlights the extreme energy efficiency achievable with Neuromorphic\nprocessor designs. Our results show that Neuromorphic designs are well-suited\nfor real-time near- and in-sensor processing on edge devices.",
        "link": "http://arxiv.org/abs/2406.15112v1",
        "source": "arXiv",
        "date": "2024-06-21 12:59:37"
    },
    {
        "title": "Neuromorphic dreaming: A pathway to efficient learning in artificial\n  agents",
        "summary": "Achieving energy efficiency in learning is a key challenge for artificial\nintelligence (AI) computing platforms. Biological systems demonstrate\nremarkable abilities to learn complex skills quickly and efficiently. Inspired\nby this, we present a hardware implementation of model-based reinforcement\nlearning (MBRL) using spiking neural networks (SNNs) on mixed-signal\nanalog/digital neuromorphic hardware. This approach leverages the energy\nefficiency of mixed-signal neuromorphic chips while achieving high sample\nefficiency through an alternation of online learning, referred to as the\n\"awake\" phase, and offline learning, known as the \"dreaming\" phase. The model\nproposed includes two symbiotic networks: an agent network that learns by\ncombining real and simulated experiences, and a learned world model network\nthat generates the simulated experiences. We validate the model by training the\nhardware implementation to play the Atari game Pong. We start from a baseline\nconsisting of an agent network learning without a world model and dreaming,\nwhich successfully learns to play the game. By incorporating dreaming, the\nnumber of required real game experiences are reduced significantly compared to\nthe baseline. The networks are implemented using a mixed-signal neuromorphic\nprocessor, with the readout layers trained using a computer in-the-loop, while\nthe other layers remain fixed. These results pave the way toward\nenergy-efficient neuromorphic learning systems capable of rapid learning in\nreal world applications and use-cases.",
        "link": "http://arxiv.org/abs/2405.15616v1",
        "source": "arXiv",
        "date": "2024-05-24 15:03:56"
    },
    {
        "title": "Performance Evaluation of Neuromorphic Hardware for Onboard Satellite\n  Communication Applications",
        "summary": "Spiking neural networks (SNNs) implemented on neuromorphic processors (NPs)\ncan enhance the energy efficiency of deployments of artificial intelligence\n(AI) for specific workloads. As such, NP represents an interesting opportunity\nfor implementing AI tasks on board power-limited satellite communication\nspacecraft. In this article, we disseminate the findings of a recently\ncompleted study which targeted the comparison in terms of performance and\npower-consumption of different satellite communication use cases implemented on\nstandard AI accelerators and on NPs. In particular, the article describes three\nprominent use cases, namely payload resource optimization, onboard interference\ndetection and classification, and dynamic receive beamforming; and compare the\nperformance of conventional convolutional neural networks (CNNs) implemented on\nXilinx's VCK5000 Versal development card and SNNs on Intel's neuromorphic chip\nLoihi 2.",
        "link": "http://arxiv.org/abs/2401.06911v1",
        "source": "arXiv",
        "date": "2024-01-12 21:56:57"
    },
    {
        "title": "SPAIC: A sub-$μ$W/Channel, 16-Channel General-Purpose Event-Based\n  Analog Front-End with Dual-Mode Encoders",
        "summary": "Low-power event-based analog front-ends (AFE) are a crucial component\nrequired to build efficient end-to-end neuromorphic processing systems for edge\ncomputing. Although several neuromorphic chips have been developed for\nimplementing spiking neural networks (SNNs) and solving a wide range of sensory\nprocessing tasks, there are only a few general-purpose analog front-end devices\nthat can be used to convert analog sensory signals into spikes and interfaced\nto neuromorphic processors. In this work, we present a novel, highly\nconfigurable analog front-end chip, denoted as SPAIC (signal-to-spike converter\nfor analog AI computation), that offers a general-purpose dual-mode analog\nsignal-to-spike encoding with delta modulation and pulse frequency modulation,\nwith tunable frequency bands. The ASIC is designed in a 180 nm process. It\nsupports and encodes a wide variety of signals spanning 4 orders of magnitude\nin frequency, and provides an event-based output that is compatible with\nexisting neuromorphic processors. We validated the ASIC for its functions and\npresent initial silicon measurement results characterizing the basic building\nblocks of the chip.",
        "link": "http://arxiv.org/abs/2309.03221v1",
        "source": "arXiv",
        "date": "2023-08-31 19:53:04"
    },
    {
        "title": "Gradient-descent hardware-aware training and deployment for mixed-signal\n  Neuromorphic processors",
        "summary": "Mixed-signal neuromorphic processors provide extremely low-power operation\nfor edge inference workloads, taking advantage of sparse asynchronous\ncomputation within Spiking Neural Networks (SNNs). However, deploying robust\napplications to these devices is complicated by limited controllability over\nanalog hardware parameters, as well as unintended parameter and dynamical\nvariations of analog circuits due to fabrication non-idealities. Here we\ndemonstrate a novel methodology for ofDine training and deployment of spiking\nneural networks (SNNs) to the mixed-signal neuromorphic processor DYNAP-SE2.\nThe methodology utilizes gradient-based training using a differentiable\nsimulation of the mixed-signal device, coupled with an unsupervised weight\nquantization method to optimize the network's parameters. Parameter noise\ninjection during training provides robustness to the effects of quantization\nand device mismatch, making the method a promising candidate for real-world\napplications under hardware constraints and non-idealities. This work extends\nRockpool, an open-source deep-learning library for SNNs, with support for\naccurate simulation of mixed-signal SNN dynamics. Our approach simplifies the\ndevelopment and deployment process for the neuromorphic community, making\nmixed-signal neuromorphic processors more accessible to researchers and\ndevelopers.",
        "link": "http://arxiv.org/abs/2303.12167v2",
        "source": "arXiv",
        "date": "2023-03-14 08:56:54"
    }
]